Workspace/test_cases/01-DLR-buffet/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            1e5;
pAll            1.15e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    INLET
    {
	type zeroGradient;
       // type            totalPressure;
       // psi             thermo:psi;  
       // gamma           1.4;      
       // p0              uniform $pAll;
       // value           uniform $pOut;

    }
    OUTLET
    {
    //    type           fixedMean;
    //    meanValue      $pOut;
    //    value          uniform 1e5;
//        type            pressureOutletNSCBC;
//        field           p;
//        gamma           1.4;
//        fieldInf        1;
//        lInf            1;
//        pInf            1e5;
//        etaAc           1;
//        value           $internalField;

        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        100000;
        lInf            1e-5;
        value           uniform 100000;
    }
    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;

    }
    Blade
    {
        type             zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
