Workspace/test_cases/01-DLR-buffet/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          121;
kwall           1;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    INLET
    {
        type turbulentIntensityKineticEnergyInlet;
        U    U;
        phi  phi;
        intensity 0.05;
        value $internalField;
        /*type      fixedValue;
        value     uniform   121;*/
    }

    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;
    }
        OUTLET
    {
        //type zeroGradient;
        type     inletOutlet;
        inletValue   uniform  121;
        value        uniform  121;
    }
    Blade
    {
        //type zeroGradient;
        type      kqRWallFunction;
        value     uniform 121;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
