Workspace/test_cases/01-DLR-buffet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         leastSquares;
    grad(U)         cellLimited leastSquares 1.0;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss MinmodV;

    turbulence      Gauss limitedLinear 1.0;
    energy          Gauss limitedLinear 1.0;

    div(phi,k)       $turbulence;
    div(phi,omega)   $turbulence;
    div(phi,nuTilda) bounded Gauss limitedLinear 1.0;
    
    div(phi,e)      $energy;
    div(phi,K)      $energy;
    div(phi,Ekp)    $energy;

    div(phiv,p)     Gauss limitedLinear 1.0;
    div(phid,p)     Gauss limitedLinear 1.0;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*(thermo:mu|rho))*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
